----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 24, 250, 250]             216
       BatchNorm2d-2         [-1, 24, 250, 250]              48
              SiLU-3         [-1, 24, 250, 250]               0
            Conv2d-4         [-1, 24, 250, 250]           5,184
       BatchNorm2d-5         [-1, 24, 250, 250]              48
              SiLU-6         [-1, 24, 250, 250]               0
         ConvBnAct-7         [-1, 24, 250, 250]               0
            Conv2d-8         [-1, 24, 250, 250]           5,184
       BatchNorm2d-9         [-1, 24, 250, 250]              48
             SiLU-10         [-1, 24, 250, 250]               0
        ConvBnAct-11         [-1, 24, 250, 250]               0
           Conv2d-12         [-1, 24, 250, 250]           5,184
      BatchNorm2d-13         [-1, 24, 250, 250]              48
             SiLU-14         [-1, 24, 250, 250]               0
        ConvBnAct-15         [-1, 24, 250, 250]               0
           Conv2d-16         [-1, 96, 125, 125]          20,736
      BatchNorm2d-17         [-1, 96, 125, 125]             192
             SiLU-18         [-1, 96, 125, 125]               0
         Identity-19         [-1, 96, 125, 125]               0
           Conv2d-20         [-1, 48, 125, 125]           4,608
      BatchNorm2d-21         [-1, 48, 125, 125]              96
     EdgeResidual-22         [-1, 48, 125, 125]               0
           Conv2d-23        [-1, 192, 125, 125]          82,944
      BatchNorm2d-24        [-1, 192, 125, 125]             384
             SiLU-25        [-1, 192, 125, 125]               0
         Identity-26        [-1, 192, 125, 125]               0
           Conv2d-27         [-1, 48, 125, 125]           9,216
      BatchNorm2d-28         [-1, 48, 125, 125]              96
     EdgeResidual-29         [-1, 48, 125, 125]               0
           Conv2d-30        [-1, 192, 125, 125]          82,944
      BatchNorm2d-31        [-1, 192, 125, 125]             384
             SiLU-32        [-1, 192, 125, 125]               0
         Identity-33        [-1, 192, 125, 125]               0
           Conv2d-34         [-1, 48, 125, 125]           9,216
      BatchNorm2d-35         [-1, 48, 125, 125]              96
     EdgeResidual-36         [-1, 48, 125, 125]               0
           Conv2d-37        [-1, 192, 125, 125]          82,944
      BatchNorm2d-38        [-1, 192, 125, 125]             384
             SiLU-39        [-1, 192, 125, 125]               0
         Identity-40        [-1, 192, 125, 125]               0
           Conv2d-41         [-1, 48, 125, 125]           9,216
      BatchNorm2d-42         [-1, 48, 125, 125]              96
     EdgeResidual-43         [-1, 48, 125, 125]               0
           Conv2d-44        [-1, 192, 125, 125]          82,944
      BatchNorm2d-45        [-1, 192, 125, 125]             384
             SiLU-46        [-1, 192, 125, 125]               0
         Identity-47        [-1, 192, 125, 125]               0
           Conv2d-48         [-1, 48, 125, 125]           9,216
      BatchNorm2d-49         [-1, 48, 125, 125]              96
     EdgeResidual-50         [-1, 48, 125, 125]               0
           Conv2d-51          [-1, 192, 63, 63]          82,944
      BatchNorm2d-52          [-1, 192, 63, 63]             384
             SiLU-53          [-1, 192, 63, 63]               0
         Identity-54          [-1, 192, 63, 63]               0
           Conv2d-55           [-1, 80, 63, 63]          15,360
      BatchNorm2d-56           [-1, 80, 63, 63]             160
     EdgeResidual-57           [-1, 80, 63, 63]               0
           Conv2d-58          [-1, 320, 63, 63]         230,400
      BatchNorm2d-59          [-1, 320, 63, 63]             640
             SiLU-60          [-1, 320, 63, 63]               0
         Identity-61          [-1, 320, 63, 63]               0
           Conv2d-62           [-1, 80, 63, 63]          25,600
      BatchNorm2d-63           [-1, 80, 63, 63]             160
     EdgeResidual-64           [-1, 80, 63, 63]               0
           Conv2d-65          [-1, 320, 63, 63]         230,400
      BatchNorm2d-66          [-1, 320, 63, 63]             640
             SiLU-67          [-1, 320, 63, 63]               0
         Identity-68          [-1, 320, 63, 63]               0
           Conv2d-69           [-1, 80, 63, 63]          25,600
      BatchNorm2d-70           [-1, 80, 63, 63]             160
     EdgeResidual-71           [-1, 80, 63, 63]               0
           Conv2d-72          [-1, 320, 63, 63]         230,400
      BatchNorm2d-73          [-1, 320, 63, 63]             640
             SiLU-74          [-1, 320, 63, 63]               0
         Identity-75          [-1, 320, 63, 63]               0
           Conv2d-76           [-1, 80, 63, 63]          25,600
      BatchNorm2d-77           [-1, 80, 63, 63]             160
     EdgeResidual-78           [-1, 80, 63, 63]               0
           Conv2d-79          [-1, 320, 63, 63]         230,400
      BatchNorm2d-80          [-1, 320, 63, 63]             640
             SiLU-81          [-1, 320, 63, 63]               0
         Identity-82          [-1, 320, 63, 63]               0
           Conv2d-83           [-1, 80, 63, 63]          25,600
      BatchNorm2d-84           [-1, 80, 63, 63]             160
     EdgeResidual-85           [-1, 80, 63, 63]               0
           Conv2d-86          [-1, 320, 63, 63]          25,600
      BatchNorm2d-87          [-1, 320, 63, 63]             640
             SiLU-88          [-1, 320, 63, 63]               0
           Conv2d-89          [-1, 320, 32, 32]           2,880
      BatchNorm2d-90          [-1, 320, 32, 32]             640
             SiLU-91          [-1, 320, 32, 32]               0
           Conv2d-92             [-1, 20, 1, 1]           6,420
             SiLU-93             [-1, 20, 1, 1]               0
           Conv2d-94            [-1, 320, 1, 1]           6,720
          Sigmoid-95            [-1, 320, 1, 1]               0
    SqueezeExcite-96          [-1, 320, 32, 32]               0
           Conv2d-97          [-1, 160, 32, 32]          51,200
      BatchNorm2d-98          [-1, 160, 32, 32]             320
 InvertedResidual-99          [-1, 160, 32, 32]               0
          Conv2d-100          [-1, 640, 32, 32]         102,400
     BatchNorm2d-101          [-1, 640, 32, 32]           1,280
            SiLU-102          [-1, 640, 32, 32]               0
          Conv2d-103          [-1, 640, 32, 32]           5,760
     BatchNorm2d-104          [-1, 640, 32, 32]           1,280
            SiLU-105          [-1, 640, 32, 32]               0
          Conv2d-106             [-1, 40, 1, 1]          25,640
            SiLU-107             [-1, 40, 1, 1]               0
          Conv2d-108            [-1, 640, 1, 1]          26,240
         Sigmoid-109            [-1, 640, 1, 1]               0
   SqueezeExcite-110          [-1, 640, 32, 32]               0
          Conv2d-111          [-1, 160, 32, 32]         102,400
     BatchNorm2d-112          [-1, 160, 32, 32]             320
InvertedResidual-113          [-1, 160, 32, 32]               0
          Conv2d-114          [-1, 640, 32, 32]         102,400
     BatchNorm2d-115          [-1, 640, 32, 32]           1,280
            SiLU-116          [-1, 640, 32, 32]               0
          Conv2d-117          [-1, 640, 32, 32]           5,760
     BatchNorm2d-118          [-1, 640, 32, 32]           1,280
            SiLU-119          [-1, 640, 32, 32]               0
          Conv2d-120             [-1, 40, 1, 1]          25,640
            SiLU-121             [-1, 40, 1, 1]               0
          Conv2d-122            [-1, 640, 1, 1]          26,240
         Sigmoid-123            [-1, 640, 1, 1]               0
   SqueezeExcite-124          [-1, 640, 32, 32]               0
          Conv2d-125          [-1, 160, 32, 32]         102,400
     BatchNorm2d-126          [-1, 160, 32, 32]             320
InvertedResidual-127          [-1, 160, 32, 32]               0
          Conv2d-128          [-1, 640, 32, 32]         102,400
     BatchNorm2d-129          [-1, 640, 32, 32]           1,280
            SiLU-130          [-1, 640, 32, 32]               0
          Conv2d-131          [-1, 640, 32, 32]           5,760
     BatchNorm2d-132          [-1, 640, 32, 32]           1,280
            SiLU-133          [-1, 640, 32, 32]               0
          Conv2d-134             [-1, 40, 1, 1]          25,640
            SiLU-135             [-1, 40, 1, 1]               0
          Conv2d-136            [-1, 640, 1, 1]          26,240
         Sigmoid-137            [-1, 640, 1, 1]               0
   SqueezeExcite-138          [-1, 640, 32, 32]               0
          Conv2d-139          [-1, 160, 32, 32]         102,400
     BatchNorm2d-140          [-1, 160, 32, 32]             320
InvertedResidual-141          [-1, 160, 32, 32]               0
          Conv2d-142          [-1, 640, 32, 32]         102,400
     BatchNorm2d-143          [-1, 640, 32, 32]           1,280
            SiLU-144          [-1, 640, 32, 32]               0
          Conv2d-145          [-1, 640, 32, 32]           5,760
     BatchNorm2d-146          [-1, 640, 32, 32]           1,280
            SiLU-147          [-1, 640, 32, 32]               0
          Conv2d-148             [-1, 40, 1, 1]          25,640
            SiLU-149             [-1, 40, 1, 1]               0
          Conv2d-150            [-1, 640, 1, 1]          26,240
         Sigmoid-151            [-1, 640, 1, 1]               0
   SqueezeExcite-152          [-1, 640, 32, 32]               0
          Conv2d-153          [-1, 160, 32, 32]         102,400
     BatchNorm2d-154          [-1, 160, 32, 32]             320
InvertedResidual-155          [-1, 160, 32, 32]               0
          Conv2d-156          [-1, 640, 32, 32]         102,400
     BatchNorm2d-157          [-1, 640, 32, 32]           1,280
            SiLU-158          [-1, 640, 32, 32]               0
          Conv2d-159          [-1, 640, 32, 32]           5,760
     BatchNorm2d-160          [-1, 640, 32, 32]           1,280
            SiLU-161          [-1, 640, 32, 32]               0
          Conv2d-162             [-1, 40, 1, 1]          25,640
            SiLU-163             [-1, 40, 1, 1]               0
          Conv2d-164            [-1, 640, 1, 1]          26,240
         Sigmoid-165            [-1, 640, 1, 1]               0
   SqueezeExcite-166          [-1, 640, 32, 32]               0
          Conv2d-167          [-1, 160, 32, 32]         102,400
     BatchNorm2d-168          [-1, 160, 32, 32]             320
InvertedResidual-169          [-1, 160, 32, 32]               0
          Conv2d-170          [-1, 640, 32, 32]         102,400
     BatchNorm2d-171          [-1, 640, 32, 32]           1,280
            SiLU-172          [-1, 640, 32, 32]               0
          Conv2d-173          [-1, 640, 32, 32]           5,760
     BatchNorm2d-174          [-1, 640, 32, 32]           1,280
            SiLU-175          [-1, 640, 32, 32]               0
          Conv2d-176             [-1, 40, 1, 1]          25,640
            SiLU-177             [-1, 40, 1, 1]               0
          Conv2d-178            [-1, 640, 1, 1]          26,240
         Sigmoid-179            [-1, 640, 1, 1]               0
   SqueezeExcite-180          [-1, 640, 32, 32]               0
          Conv2d-181          [-1, 160, 32, 32]         102,400
     BatchNorm2d-182          [-1, 160, 32, 32]             320
InvertedResidual-183          [-1, 160, 32, 32]               0
          Conv2d-184          [-1, 960, 32, 32]         153,600
     BatchNorm2d-185          [-1, 960, 32, 32]           1,920
            SiLU-186          [-1, 960, 32, 32]               0
          Conv2d-187          [-1, 960, 32, 32]           8,640
     BatchNorm2d-188          [-1, 960, 32, 32]           1,920
            SiLU-189          [-1, 960, 32, 32]               0
          Conv2d-190             [-1, 40, 1, 1]          38,440
            SiLU-191             [-1, 40, 1, 1]               0
          Conv2d-192            [-1, 960, 1, 1]          39,360
         Sigmoid-193            [-1, 960, 1, 1]               0
   SqueezeExcite-194          [-1, 960, 32, 32]               0
          Conv2d-195          [-1, 176, 32, 32]         168,960
     BatchNorm2d-196          [-1, 176, 32, 32]             352
InvertedResidual-197          [-1, 176, 32, 32]               0
          Conv2d-198         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-199         [-1, 1056, 32, 32]           2,112
            SiLU-200         [-1, 1056, 32, 32]               0
          Conv2d-201         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-202         [-1, 1056, 32, 32]           2,112
            SiLU-203         [-1, 1056, 32, 32]               0
          Conv2d-204             [-1, 44, 1, 1]          46,508
            SiLU-205             [-1, 44, 1, 1]               0
          Conv2d-206           [-1, 1056, 1, 1]          47,520
         Sigmoid-207           [-1, 1056, 1, 1]               0
   SqueezeExcite-208         [-1, 1056, 32, 32]               0
          Conv2d-209          [-1, 176, 32, 32]         185,856
     BatchNorm2d-210          [-1, 176, 32, 32]             352
InvertedResidual-211          [-1, 176, 32, 32]               0
          Conv2d-212         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-213         [-1, 1056, 32, 32]           2,112
            SiLU-214         [-1, 1056, 32, 32]               0
          Conv2d-215         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-216         [-1, 1056, 32, 32]           2,112
            SiLU-217         [-1, 1056, 32, 32]               0
          Conv2d-218             [-1, 44, 1, 1]          46,508
            SiLU-219             [-1, 44, 1, 1]               0
          Conv2d-220           [-1, 1056, 1, 1]          47,520
         Sigmoid-221           [-1, 1056, 1, 1]               0
   SqueezeExcite-222         [-1, 1056, 32, 32]               0
          Conv2d-223          [-1, 176, 32, 32]         185,856
     BatchNorm2d-224          [-1, 176, 32, 32]             352
InvertedResidual-225          [-1, 176, 32, 32]               0
          Conv2d-226         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-227         [-1, 1056, 32, 32]           2,112
            SiLU-228         [-1, 1056, 32, 32]               0
          Conv2d-229         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-230         [-1, 1056, 32, 32]           2,112
            SiLU-231         [-1, 1056, 32, 32]               0
          Conv2d-232             [-1, 44, 1, 1]          46,508
            SiLU-233             [-1, 44, 1, 1]               0
          Conv2d-234           [-1, 1056, 1, 1]          47,520
         Sigmoid-235           [-1, 1056, 1, 1]               0
   SqueezeExcite-236         [-1, 1056, 32, 32]               0
          Conv2d-237          [-1, 176, 32, 32]         185,856
     BatchNorm2d-238          [-1, 176, 32, 32]             352
InvertedResidual-239          [-1, 176, 32, 32]               0
          Conv2d-240         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-241         [-1, 1056, 32, 32]           2,112
            SiLU-242         [-1, 1056, 32, 32]               0
          Conv2d-243         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-244         [-1, 1056, 32, 32]           2,112
            SiLU-245         [-1, 1056, 32, 32]               0
          Conv2d-246             [-1, 44, 1, 1]          46,508
            SiLU-247             [-1, 44, 1, 1]               0
          Conv2d-248           [-1, 1056, 1, 1]          47,520
         Sigmoid-249           [-1, 1056, 1, 1]               0
   SqueezeExcite-250         [-1, 1056, 32, 32]               0
          Conv2d-251          [-1, 176, 32, 32]         185,856
     BatchNorm2d-252          [-1, 176, 32, 32]             352
InvertedResidual-253          [-1, 176, 32, 32]               0
          Conv2d-254         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-255         [-1, 1056, 32, 32]           2,112
            SiLU-256         [-1, 1056, 32, 32]               0
          Conv2d-257         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-258         [-1, 1056, 32, 32]           2,112
            SiLU-259         [-1, 1056, 32, 32]               0
          Conv2d-260             [-1, 44, 1, 1]          46,508
            SiLU-261             [-1, 44, 1, 1]               0
          Conv2d-262           [-1, 1056, 1, 1]          47,520
         Sigmoid-263           [-1, 1056, 1, 1]               0
   SqueezeExcite-264         [-1, 1056, 32, 32]               0
          Conv2d-265          [-1, 176, 32, 32]         185,856
     BatchNorm2d-266          [-1, 176, 32, 32]             352
InvertedResidual-267          [-1, 176, 32, 32]               0
          Conv2d-268         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-269         [-1, 1056, 32, 32]           2,112
            SiLU-270         [-1, 1056, 32, 32]               0
          Conv2d-271         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-272         [-1, 1056, 32, 32]           2,112
            SiLU-273         [-1, 1056, 32, 32]               0
          Conv2d-274             [-1, 44, 1, 1]          46,508
            SiLU-275             [-1, 44, 1, 1]               0
          Conv2d-276           [-1, 1056, 1, 1]          47,520
         Sigmoid-277           [-1, 1056, 1, 1]               0
   SqueezeExcite-278         [-1, 1056, 32, 32]               0
          Conv2d-279          [-1, 176, 32, 32]         185,856
     BatchNorm2d-280          [-1, 176, 32, 32]             352
InvertedResidual-281          [-1, 176, 32, 32]               0
          Conv2d-282         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-283         [-1, 1056, 32, 32]           2,112
            SiLU-284         [-1, 1056, 32, 32]               0
          Conv2d-285         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-286         [-1, 1056, 32, 32]           2,112
            SiLU-287         [-1, 1056, 32, 32]               0
          Conv2d-288             [-1, 44, 1, 1]          46,508
            SiLU-289             [-1, 44, 1, 1]               0
          Conv2d-290           [-1, 1056, 1, 1]          47,520
         Sigmoid-291           [-1, 1056, 1, 1]               0
   SqueezeExcite-292         [-1, 1056, 32, 32]               0
          Conv2d-293          [-1, 176, 32, 32]         185,856
     BatchNorm2d-294          [-1, 176, 32, 32]             352
InvertedResidual-295          [-1, 176, 32, 32]               0
          Conv2d-296         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-297         [-1, 1056, 32, 32]           2,112
            SiLU-298         [-1, 1056, 32, 32]               0
          Conv2d-299         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-300         [-1, 1056, 32, 32]           2,112
            SiLU-301         [-1, 1056, 32, 32]               0
          Conv2d-302             [-1, 44, 1, 1]          46,508
            SiLU-303             [-1, 44, 1, 1]               0
          Conv2d-304           [-1, 1056, 1, 1]          47,520
         Sigmoid-305           [-1, 1056, 1, 1]               0
   SqueezeExcite-306         [-1, 1056, 32, 32]               0
          Conv2d-307          [-1, 176, 32, 32]         185,856
     BatchNorm2d-308          [-1, 176, 32, 32]             352
InvertedResidual-309          [-1, 176, 32, 32]               0
          Conv2d-310         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-311         [-1, 1056, 32, 32]           2,112
            SiLU-312         [-1, 1056, 32, 32]               0
          Conv2d-313         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-314         [-1, 1056, 32, 32]           2,112
            SiLU-315         [-1, 1056, 32, 32]               0
          Conv2d-316             [-1, 44, 1, 1]          46,508
            SiLU-317             [-1, 44, 1, 1]               0
          Conv2d-318           [-1, 1056, 1, 1]          47,520
         Sigmoid-319           [-1, 1056, 1, 1]               0
   SqueezeExcite-320         [-1, 1056, 32, 32]               0
          Conv2d-321          [-1, 176, 32, 32]         185,856
     BatchNorm2d-322          [-1, 176, 32, 32]             352
InvertedResidual-323          [-1, 176, 32, 32]               0
          Conv2d-324         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-325         [-1, 1056, 32, 32]           2,112
            SiLU-326         [-1, 1056, 32, 32]               0
          Conv2d-327         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-328         [-1, 1056, 32, 32]           2,112
            SiLU-329         [-1, 1056, 32, 32]               0
          Conv2d-330             [-1, 44, 1, 1]          46,508
            SiLU-331             [-1, 44, 1, 1]               0
          Conv2d-332           [-1, 1056, 1, 1]          47,520
         Sigmoid-333           [-1, 1056, 1, 1]               0
   SqueezeExcite-334         [-1, 1056, 32, 32]               0
          Conv2d-335          [-1, 176, 32, 32]         185,856
     BatchNorm2d-336          [-1, 176, 32, 32]             352
InvertedResidual-337          [-1, 176, 32, 32]               0
          Conv2d-338         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-339         [-1, 1056, 32, 32]           2,112
            SiLU-340         [-1, 1056, 32, 32]               0
          Conv2d-341         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-342         [-1, 1056, 32, 32]           2,112
            SiLU-343         [-1, 1056, 32, 32]               0
          Conv2d-344             [-1, 44, 1, 1]          46,508
            SiLU-345             [-1, 44, 1, 1]               0
          Conv2d-346           [-1, 1056, 1, 1]          47,520
         Sigmoid-347           [-1, 1056, 1, 1]               0
   SqueezeExcite-348         [-1, 1056, 32, 32]               0
          Conv2d-349          [-1, 176, 32, 32]         185,856
     BatchNorm2d-350          [-1, 176, 32, 32]             352
InvertedResidual-351          [-1, 176, 32, 32]               0
          Conv2d-352         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-353         [-1, 1056, 32, 32]           2,112
            SiLU-354         [-1, 1056, 32, 32]               0
          Conv2d-355         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-356         [-1, 1056, 32, 32]           2,112
            SiLU-357         [-1, 1056, 32, 32]               0
          Conv2d-358             [-1, 44, 1, 1]          46,508
            SiLU-359             [-1, 44, 1, 1]               0
          Conv2d-360           [-1, 1056, 1, 1]          47,520
         Sigmoid-361           [-1, 1056, 1, 1]               0
   SqueezeExcite-362         [-1, 1056, 32, 32]               0
          Conv2d-363          [-1, 176, 32, 32]         185,856
     BatchNorm2d-364          [-1, 176, 32, 32]             352
InvertedResidual-365          [-1, 176, 32, 32]               0
          Conv2d-366         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-367         [-1, 1056, 32, 32]           2,112
            SiLU-368         [-1, 1056, 32, 32]               0
          Conv2d-369         [-1, 1056, 32, 32]           9,504
     BatchNorm2d-370         [-1, 1056, 32, 32]           2,112
            SiLU-371         [-1, 1056, 32, 32]               0
          Conv2d-372             [-1, 44, 1, 1]          46,508
            SiLU-373             [-1, 44, 1, 1]               0
          Conv2d-374           [-1, 1056, 1, 1]          47,520
         Sigmoid-375           [-1, 1056, 1, 1]               0
   SqueezeExcite-376         [-1, 1056, 32, 32]               0
          Conv2d-377          [-1, 176, 32, 32]         185,856
     BatchNorm2d-378          [-1, 176, 32, 32]             352
InvertedResidual-379          [-1, 176, 32, 32]               0
          Conv2d-380         [-1, 1056, 32, 32]         185,856
     BatchNorm2d-381         [-1, 1056, 32, 32]           2,112
            SiLU-382         [-1, 1056, 32, 32]               0
          Conv2d-383         [-1, 1056, 16, 16]           9,504
     BatchNorm2d-384         [-1, 1056, 16, 16]           2,112
            SiLU-385         [-1, 1056, 16, 16]               0
          Conv2d-386             [-1, 44, 1, 1]          46,508
            SiLU-387             [-1, 44, 1, 1]               0
          Conv2d-388           [-1, 1056, 1, 1]          47,520
         Sigmoid-389           [-1, 1056, 1, 1]               0
   SqueezeExcite-390         [-1, 1056, 16, 16]               0
          Conv2d-391          [-1, 304, 16, 16]         321,024
     BatchNorm2d-392          [-1, 304, 16, 16]             608
InvertedResidual-393          [-1, 304, 16, 16]               0
          Conv2d-394         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-395         [-1, 1824, 16, 16]           3,648
            SiLU-396         [-1, 1824, 16, 16]               0
          Conv2d-397         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-398         [-1, 1824, 16, 16]           3,648
            SiLU-399         [-1, 1824, 16, 16]               0
          Conv2d-400             [-1, 76, 1, 1]         138,700
            SiLU-401             [-1, 76, 1, 1]               0
          Conv2d-402           [-1, 1824, 1, 1]         140,448
         Sigmoid-403           [-1, 1824, 1, 1]               0
   SqueezeExcite-404         [-1, 1824, 16, 16]               0
          Conv2d-405          [-1, 304, 16, 16]         554,496
     BatchNorm2d-406          [-1, 304, 16, 16]             608
InvertedResidual-407          [-1, 304, 16, 16]               0
          Conv2d-408         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-409         [-1, 1824, 16, 16]           3,648
            SiLU-410         [-1, 1824, 16, 16]               0
          Conv2d-411         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-412         [-1, 1824, 16, 16]           3,648
            SiLU-413         [-1, 1824, 16, 16]               0
          Conv2d-414             [-1, 76, 1, 1]         138,700
            SiLU-415             [-1, 76, 1, 1]               0
          Conv2d-416           [-1, 1824, 1, 1]         140,448
         Sigmoid-417           [-1, 1824, 1, 1]               0
   SqueezeExcite-418         [-1, 1824, 16, 16]               0
          Conv2d-419          [-1, 304, 16, 16]         554,496
     BatchNorm2d-420          [-1, 304, 16, 16]             608
InvertedResidual-421          [-1, 304, 16, 16]               0
          Conv2d-422         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-423         [-1, 1824, 16, 16]           3,648
            SiLU-424         [-1, 1824, 16, 16]               0
          Conv2d-425         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-426         [-1, 1824, 16, 16]           3,648
            SiLU-427         [-1, 1824, 16, 16]               0
          Conv2d-428             [-1, 76, 1, 1]         138,700
            SiLU-429             [-1, 76, 1, 1]               0
          Conv2d-430           [-1, 1824, 1, 1]         140,448
         Sigmoid-431           [-1, 1824, 1, 1]               0
   SqueezeExcite-432         [-1, 1824, 16, 16]               0
          Conv2d-433          [-1, 304, 16, 16]         554,496
     BatchNorm2d-434          [-1, 304, 16, 16]             608
InvertedResidual-435          [-1, 304, 16, 16]               0
          Conv2d-436         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-437         [-1, 1824, 16, 16]           3,648
            SiLU-438         [-1, 1824, 16, 16]               0
          Conv2d-439         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-440         [-1, 1824, 16, 16]           3,648
            SiLU-441         [-1, 1824, 16, 16]               0
          Conv2d-442             [-1, 76, 1, 1]         138,700
            SiLU-443             [-1, 76, 1, 1]               0
          Conv2d-444           [-1, 1824, 1, 1]         140,448
         Sigmoid-445           [-1, 1824, 1, 1]               0
   SqueezeExcite-446         [-1, 1824, 16, 16]               0
          Conv2d-447          [-1, 304, 16, 16]         554,496
     BatchNorm2d-448          [-1, 304, 16, 16]             608
InvertedResidual-449          [-1, 304, 16, 16]               0
          Conv2d-450         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-451         [-1, 1824, 16, 16]           3,648
            SiLU-452         [-1, 1824, 16, 16]               0
          Conv2d-453         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-454         [-1, 1824, 16, 16]           3,648
            SiLU-455         [-1, 1824, 16, 16]               0
          Conv2d-456             [-1, 76, 1, 1]         138,700
            SiLU-457             [-1, 76, 1, 1]               0
          Conv2d-458           [-1, 1824, 1, 1]         140,448
         Sigmoid-459           [-1, 1824, 1, 1]               0
   SqueezeExcite-460         [-1, 1824, 16, 16]               0
          Conv2d-461          [-1, 304, 16, 16]         554,496
     BatchNorm2d-462          [-1, 304, 16, 16]             608
InvertedResidual-463          [-1, 304, 16, 16]               0
          Conv2d-464         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-465         [-1, 1824, 16, 16]           3,648
            SiLU-466         [-1, 1824, 16, 16]               0
          Conv2d-467         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-468         [-1, 1824, 16, 16]           3,648
            SiLU-469         [-1, 1824, 16, 16]               0
          Conv2d-470             [-1, 76, 1, 1]         138,700
            SiLU-471             [-1, 76, 1, 1]               0
          Conv2d-472           [-1, 1824, 1, 1]         140,448
         Sigmoid-473           [-1, 1824, 1, 1]               0
   SqueezeExcite-474         [-1, 1824, 16, 16]               0
          Conv2d-475          [-1, 304, 16, 16]         554,496
     BatchNorm2d-476          [-1, 304, 16, 16]             608
InvertedResidual-477          [-1, 304, 16, 16]               0
          Conv2d-478         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-479         [-1, 1824, 16, 16]           3,648
            SiLU-480         [-1, 1824, 16, 16]               0
          Conv2d-481         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-482         [-1, 1824, 16, 16]           3,648
            SiLU-483         [-1, 1824, 16, 16]               0
          Conv2d-484             [-1, 76, 1, 1]         138,700
            SiLU-485             [-1, 76, 1, 1]               0
          Conv2d-486           [-1, 1824, 1, 1]         140,448
         Sigmoid-487           [-1, 1824, 1, 1]               0
   SqueezeExcite-488         [-1, 1824, 16, 16]               0
          Conv2d-489          [-1, 304, 16, 16]         554,496
     BatchNorm2d-490          [-1, 304, 16, 16]             608
InvertedResidual-491          [-1, 304, 16, 16]               0
          Conv2d-492         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-493         [-1, 1824, 16, 16]           3,648
            SiLU-494         [-1, 1824, 16, 16]               0
          Conv2d-495         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-496         [-1, 1824, 16, 16]           3,648
            SiLU-497         [-1, 1824, 16, 16]               0
          Conv2d-498             [-1, 76, 1, 1]         138,700
            SiLU-499             [-1, 76, 1, 1]               0
          Conv2d-500           [-1, 1824, 1, 1]         140,448
         Sigmoid-501           [-1, 1824, 1, 1]               0
   SqueezeExcite-502         [-1, 1824, 16, 16]               0
          Conv2d-503          [-1, 304, 16, 16]         554,496
     BatchNorm2d-504          [-1, 304, 16, 16]             608
InvertedResidual-505          [-1, 304, 16, 16]               0
          Conv2d-506         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-507         [-1, 1824, 16, 16]           3,648
            SiLU-508         [-1, 1824, 16, 16]               0
          Conv2d-509         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-510         [-1, 1824, 16, 16]           3,648
            SiLU-511         [-1, 1824, 16, 16]               0
          Conv2d-512             [-1, 76, 1, 1]         138,700
            SiLU-513             [-1, 76, 1, 1]               0
          Conv2d-514           [-1, 1824, 1, 1]         140,448
         Sigmoid-515           [-1, 1824, 1, 1]               0
   SqueezeExcite-516         [-1, 1824, 16, 16]               0
          Conv2d-517          [-1, 304, 16, 16]         554,496
     BatchNorm2d-518          [-1, 304, 16, 16]             608
InvertedResidual-519          [-1, 304, 16, 16]               0
          Conv2d-520         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-521         [-1, 1824, 16, 16]           3,648
            SiLU-522         [-1, 1824, 16, 16]               0
          Conv2d-523         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-524         [-1, 1824, 16, 16]           3,648
            SiLU-525         [-1, 1824, 16, 16]               0
          Conv2d-526             [-1, 76, 1, 1]         138,700
            SiLU-527             [-1, 76, 1, 1]               0
          Conv2d-528           [-1, 1824, 1, 1]         140,448
         Sigmoid-529           [-1, 1824, 1, 1]               0
   SqueezeExcite-530         [-1, 1824, 16, 16]               0
          Conv2d-531          [-1, 304, 16, 16]         554,496
     BatchNorm2d-532          [-1, 304, 16, 16]             608
InvertedResidual-533          [-1, 304, 16, 16]               0
          Conv2d-534         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-535         [-1, 1824, 16, 16]           3,648
            SiLU-536         [-1, 1824, 16, 16]               0
          Conv2d-537         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-538         [-1, 1824, 16, 16]           3,648
            SiLU-539         [-1, 1824, 16, 16]               0
          Conv2d-540             [-1, 76, 1, 1]         138,700
            SiLU-541             [-1, 76, 1, 1]               0
          Conv2d-542           [-1, 1824, 1, 1]         140,448
         Sigmoid-543           [-1, 1824, 1, 1]               0
   SqueezeExcite-544         [-1, 1824, 16, 16]               0
          Conv2d-545          [-1, 304, 16, 16]         554,496
     BatchNorm2d-546          [-1, 304, 16, 16]             608
InvertedResidual-547          [-1, 304, 16, 16]               0
          Conv2d-548         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-549         [-1, 1824, 16, 16]           3,648
            SiLU-550         [-1, 1824, 16, 16]               0
          Conv2d-551         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-552         [-1, 1824, 16, 16]           3,648
            SiLU-553         [-1, 1824, 16, 16]               0
          Conv2d-554             [-1, 76, 1, 1]         138,700
            SiLU-555             [-1, 76, 1, 1]               0
          Conv2d-556           [-1, 1824, 1, 1]         140,448
         Sigmoid-557           [-1, 1824, 1, 1]               0
   SqueezeExcite-558         [-1, 1824, 16, 16]               0
          Conv2d-559          [-1, 304, 16, 16]         554,496
     BatchNorm2d-560          [-1, 304, 16, 16]             608
InvertedResidual-561          [-1, 304, 16, 16]               0
          Conv2d-562         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-563         [-1, 1824, 16, 16]           3,648
            SiLU-564         [-1, 1824, 16, 16]               0
          Conv2d-565         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-566         [-1, 1824, 16, 16]           3,648
            SiLU-567         [-1, 1824, 16, 16]               0
          Conv2d-568             [-1, 76, 1, 1]         138,700
            SiLU-569             [-1, 76, 1, 1]               0
          Conv2d-570           [-1, 1824, 1, 1]         140,448
         Sigmoid-571           [-1, 1824, 1, 1]               0
   SqueezeExcite-572         [-1, 1824, 16, 16]               0
          Conv2d-573          [-1, 304, 16, 16]         554,496
     BatchNorm2d-574          [-1, 304, 16, 16]             608
InvertedResidual-575          [-1, 304, 16, 16]               0
          Conv2d-576         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-577         [-1, 1824, 16, 16]           3,648
            SiLU-578         [-1, 1824, 16, 16]               0
          Conv2d-579         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-580         [-1, 1824, 16, 16]           3,648
            SiLU-581         [-1, 1824, 16, 16]               0
          Conv2d-582             [-1, 76, 1, 1]         138,700
            SiLU-583             [-1, 76, 1, 1]               0
          Conv2d-584           [-1, 1824, 1, 1]         140,448
         Sigmoid-585           [-1, 1824, 1, 1]               0
   SqueezeExcite-586         [-1, 1824, 16, 16]               0
          Conv2d-587          [-1, 304, 16, 16]         554,496
     BatchNorm2d-588          [-1, 304, 16, 16]             608
InvertedResidual-589          [-1, 304, 16, 16]               0
          Conv2d-590         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-591         [-1, 1824, 16, 16]           3,648
            SiLU-592         [-1, 1824, 16, 16]               0
          Conv2d-593         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-594         [-1, 1824, 16, 16]           3,648
            SiLU-595         [-1, 1824, 16, 16]               0
          Conv2d-596             [-1, 76, 1, 1]         138,700
            SiLU-597             [-1, 76, 1, 1]               0
          Conv2d-598           [-1, 1824, 1, 1]         140,448
         Sigmoid-599           [-1, 1824, 1, 1]               0
   SqueezeExcite-600         [-1, 1824, 16, 16]               0
          Conv2d-601          [-1, 304, 16, 16]         554,496
     BatchNorm2d-602          [-1, 304, 16, 16]             608
InvertedResidual-603          [-1, 304, 16, 16]               0
          Conv2d-604         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-605         [-1, 1824, 16, 16]           3,648
            SiLU-606         [-1, 1824, 16, 16]               0
          Conv2d-607         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-608         [-1, 1824, 16, 16]           3,648
            SiLU-609         [-1, 1824, 16, 16]               0
          Conv2d-610             [-1, 76, 1, 1]         138,700
            SiLU-611             [-1, 76, 1, 1]               0
          Conv2d-612           [-1, 1824, 1, 1]         140,448
         Sigmoid-613           [-1, 1824, 1, 1]               0
   SqueezeExcite-614         [-1, 1824, 16, 16]               0
          Conv2d-615          [-1, 304, 16, 16]         554,496
     BatchNorm2d-616          [-1, 304, 16, 16]             608
InvertedResidual-617          [-1, 304, 16, 16]               0
          Conv2d-618         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-619         [-1, 1824, 16, 16]           3,648
            SiLU-620         [-1, 1824, 16, 16]               0
          Conv2d-621         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-622         [-1, 1824, 16, 16]           3,648
            SiLU-623         [-1, 1824, 16, 16]               0
          Conv2d-624             [-1, 76, 1, 1]         138,700
            SiLU-625             [-1, 76, 1, 1]               0
          Conv2d-626           [-1, 1824, 1, 1]         140,448
         Sigmoid-627           [-1, 1824, 1, 1]               0
   SqueezeExcite-628         [-1, 1824, 16, 16]               0
          Conv2d-629          [-1, 304, 16, 16]         554,496
     BatchNorm2d-630          [-1, 304, 16, 16]             608
InvertedResidual-631          [-1, 304, 16, 16]               0
          Conv2d-632         [-1, 1824, 16, 16]         554,496
     BatchNorm2d-633         [-1, 1824, 16, 16]           3,648
            SiLU-634         [-1, 1824, 16, 16]               0
          Conv2d-635         [-1, 1824, 16, 16]          16,416
     BatchNorm2d-636         [-1, 1824, 16, 16]           3,648
            SiLU-637         [-1, 1824, 16, 16]               0
          Conv2d-638             [-1, 76, 1, 1]         138,700
            SiLU-639             [-1, 76, 1, 1]               0
          Conv2d-640           [-1, 1824, 1, 1]         140,448
         Sigmoid-641           [-1, 1824, 1, 1]               0
   SqueezeExcite-642         [-1, 1824, 16, 16]               0
          Conv2d-643          [-1, 512, 16, 16]         933,888
     BatchNorm2d-644          [-1, 512, 16, 16]           1,024
InvertedResidual-645          [-1, 512, 16, 16]               0
          Conv2d-646         [-1, 3072, 16, 16]       1,572,864
     BatchNorm2d-647         [-1, 3072, 16, 16]           6,144
            SiLU-648         [-1, 3072, 16, 16]               0
          Conv2d-649         [-1, 3072, 16, 16]          27,648
     BatchNorm2d-650         [-1, 3072, 16, 16]           6,144
            SiLU-651         [-1, 3072, 16, 16]               0
          Conv2d-652            [-1, 128, 1, 1]         393,344
            SiLU-653            [-1, 128, 1, 1]               0
          Conv2d-654           [-1, 3072, 1, 1]         396,288
         Sigmoid-655           [-1, 3072, 1, 1]               0
   SqueezeExcite-656         [-1, 3072, 16, 16]               0
          Conv2d-657          [-1, 512, 16, 16]       1,572,864
     BatchNorm2d-658          [-1, 512, 16, 16]           1,024
InvertedResidual-659          [-1, 512, 16, 16]               0
          Conv2d-660         [-1, 3072, 16, 16]       1,572,864
     BatchNorm2d-661         [-1, 3072, 16, 16]           6,144
            SiLU-662         [-1, 3072, 16, 16]               0
          Conv2d-663         [-1, 3072, 16, 16]          27,648
     BatchNorm2d-664         [-1, 3072, 16, 16]           6,144
            SiLU-665         [-1, 3072, 16, 16]               0
          Conv2d-666            [-1, 128, 1, 1]         393,344
            SiLU-667            [-1, 128, 1, 1]               0
          Conv2d-668           [-1, 3072, 1, 1]         396,288
         Sigmoid-669           [-1, 3072, 1, 1]               0
   SqueezeExcite-670         [-1, 3072, 16, 16]               0
          Conv2d-671          [-1, 512, 16, 16]       1,572,864
     BatchNorm2d-672          [-1, 512, 16, 16]           1,024
InvertedResidual-673          [-1, 512, 16, 16]               0
          Conv2d-674         [-1, 3072, 16, 16]       1,572,864
     BatchNorm2d-675         [-1, 3072, 16, 16]           6,144
            SiLU-676         [-1, 3072, 16, 16]               0
          Conv2d-677         [-1, 3072, 16, 16]          27,648
     BatchNorm2d-678         [-1, 3072, 16, 16]           6,144
            SiLU-679         [-1, 3072, 16, 16]               0
          Conv2d-680            [-1, 128, 1, 1]         393,344
            SiLU-681            [-1, 128, 1, 1]               0
          Conv2d-682           [-1, 3072, 1, 1]         396,288
         Sigmoid-683           [-1, 3072, 1, 1]               0
   SqueezeExcite-684         [-1, 3072, 16, 16]               0
          Conv2d-685          [-1, 512, 16, 16]       1,572,864
     BatchNorm2d-686          [-1, 512, 16, 16]           1,024
InvertedResidual-687          [-1, 512, 16, 16]               0
          Conv2d-688         [-1, 3072, 16, 16]       1,572,864
     BatchNorm2d-689         [-1, 3072, 16, 16]           6,144
            SiLU-690         [-1, 3072, 16, 16]               0
          Conv2d-691         [-1, 3072, 16, 16]          27,648
     BatchNorm2d-692         [-1, 3072, 16, 16]           6,144
            SiLU-693         [-1, 3072, 16, 16]               0
          Conv2d-694            [-1, 128, 1, 1]         393,344
            SiLU-695            [-1, 128, 1, 1]               0
          Conv2d-696           [-1, 3072, 1, 1]         396,288
         Sigmoid-697           [-1, 3072, 1, 1]               0
   SqueezeExcite-698         [-1, 3072, 16, 16]               0
          Conv2d-699          [-1, 512, 16, 16]       1,572,864
     BatchNorm2d-700          [-1, 512, 16, 16]           1,024
InvertedResidual-701          [-1, 512, 16, 16]               0
          Conv2d-702         [-1, 1280, 16, 16]         655,360
     BatchNorm2d-703         [-1, 1280, 16, 16]           2,560
            SiLU-704         [-1, 1280, 16, 16]               0
AdaptiveAvgPool2d-705           [-1, 1280, 2, 2]               0
        Identity-706           [-1, 1280, 2, 2]               0
    EfficientNet-707           [-1, 1280, 2, 2]               0
         Flatten-708                 [-1, 5120]               0
          Linear-709             [-1, 1, 1, 16]              32
            SiLU-710             [-1, 1, 1, 16]               0
         Flatten-711                   [-1, 16]               0
          Linear-712                 [-1, 1000]       5,137,000
            SiLU-713                 [-1, 1000]               0
          Linear-714                 [-1, 1000]       1,001,000
            SiLU-715                 [-1, 1000]               0
          Linear-716                    [-1, 1]           1,001
================================================================
Total params: 58,996,957
Trainable params: 58,996,957
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.95
Forward/backward pass size (MB): 2726.09
Params size (MB): 225.06
Estimated Total Size (MB): 2952.10
----------------------------------------------------------------