----------------------------------------------------------------
        Layer (type)               Output Shape         Param # 
================================================================
            Conv2d-1         [-1, 24, 250, 250]             216 
       BatchNorm2d-2         [-1, 24, 250, 250]              48 
              SiLU-3         [-1, 24, 250, 250]               0 
            Conv2d-4         [-1, 24, 250, 250]           5,184 
       BatchNorm2d-5         [-1, 24, 250, 250]              48 
              SiLU-6         [-1, 24, 250, 250]               0 
         ConvBnAct-7         [-1, 24, 250, 250]               0 
            Conv2d-8         [-1, 24, 250, 250]           5,184 
       BatchNorm2d-9         [-1, 24, 250, 250]              48 
             SiLU-10         [-1, 24, 250, 250]               0 
        ConvBnAct-11         [-1, 24, 250, 250]               0 
           Conv2d-12         [-1, 96, 125, 125]          20,736 
      BatchNorm2d-13         [-1, 96, 125, 125]             192 
             SiLU-14         [-1, 96, 125, 125]               0 
         Identity-15         [-1, 96, 125, 125]               0 
           Conv2d-16         [-1, 48, 125, 125]           4,608 
      BatchNorm2d-17         [-1, 48, 125, 125]              96 
     EdgeResidual-18         [-1, 48, 125, 125]               0 
           Conv2d-19        [-1, 192, 125, 125]          82,944 
      BatchNorm2d-20        [-1, 192, 125, 125]             384 
             SiLU-21        [-1, 192, 125, 125]               0 
         Identity-22        [-1, 192, 125, 125]               0
           Conv2d-23         [-1, 48, 125, 125]           9,216
      BatchNorm2d-24         [-1, 48, 125, 125]              96
     EdgeResidual-25         [-1, 48, 125, 125]               0
           Conv2d-26        [-1, 192, 125, 125]          82,944
      BatchNorm2d-27        [-1, 192, 125, 125]             384
             SiLU-28        [-1, 192, 125, 125]               0
         Identity-29        [-1, 192, 125, 125]               0
           Conv2d-30         [-1, 48, 125, 125]           9,216
      BatchNorm2d-31         [-1, 48, 125, 125]              96
     EdgeResidual-32         [-1, 48, 125, 125]               0
           Conv2d-33        [-1, 192, 125, 125]          82,944
      BatchNorm2d-34        [-1, 192, 125, 125]             384
             SiLU-35        [-1, 192, 125, 125]               0
         Identity-36        [-1, 192, 125, 125]               0
           Conv2d-37         [-1, 48, 125, 125]           9,216
      BatchNorm2d-38         [-1, 48, 125, 125]              96
     EdgeResidual-39         [-1, 48, 125, 125]               0
           Conv2d-40          [-1, 192, 63, 63]          82,944
      BatchNorm2d-41          [-1, 192, 63, 63]             384
             SiLU-42          [-1, 192, 63, 63]               0
         Identity-43          [-1, 192, 63, 63]               0
           Conv2d-44           [-1, 64, 63, 63]          12,288
      BatchNorm2d-45           [-1, 64, 63, 63]             128
     EdgeResidual-46           [-1, 64, 63, 63]               0
           Conv2d-47          [-1, 256, 63, 63]         147,456
      BatchNorm2d-48          [-1, 256, 63, 63]             512
             SiLU-49          [-1, 256, 63, 63]               0
         Identity-50          [-1, 256, 63, 63]               0
           Conv2d-51           [-1, 64, 63, 63]          16,384
      BatchNorm2d-52           [-1, 64, 63, 63]             128
     EdgeResidual-53           [-1, 64, 63, 63]               0
           Conv2d-54          [-1, 256, 63, 63]         147,456
      BatchNorm2d-55          [-1, 256, 63, 63]             512
             SiLU-56          [-1, 256, 63, 63]               0
         Identity-57          [-1, 256, 63, 63]               0
           Conv2d-58           [-1, 64, 63, 63]          16,384
      BatchNorm2d-59           [-1, 64, 63, 63]             128
     EdgeResidual-60           [-1, 64, 63, 63]               0
           Conv2d-61          [-1, 256, 63, 63]         147,456
      BatchNorm2d-62          [-1, 256, 63, 63]             512
             SiLU-63          [-1, 256, 63, 63]               0
         Identity-64          [-1, 256, 63, 63]               0
           Conv2d-65           [-1, 64, 63, 63]          16,384
      BatchNorm2d-66           [-1, 64, 63, 63]             128
     EdgeResidual-67           [-1, 64, 63, 63]               0
           Conv2d-68          [-1, 256, 63, 63]          16,384
      BatchNorm2d-69          [-1, 256, 63, 63]             512
             SiLU-70          [-1, 256, 63, 63]               0
           Conv2d-71          [-1, 256, 32, 32]           2,304
      BatchNorm2d-72          [-1, 256, 32, 32]             512
             SiLU-73          [-1, 256, 32, 32]               0
           Conv2d-74             [-1, 16, 1, 1]           4,112
             SiLU-75             [-1, 16, 1, 1]               0
           Conv2d-76            [-1, 256, 1, 1]           4,352
          Sigmoid-77            [-1, 256, 1, 1]               0
    SqueezeExcite-78          [-1, 256, 32, 32]               0
           Conv2d-79          [-1, 128, 32, 32]          32,768
      BatchNorm2d-80          [-1, 128, 32, 32]             256
 InvertedResidual-81          [-1, 128, 32, 32]               0
           Conv2d-82          [-1, 512, 32, 32]          65,536
      BatchNorm2d-83          [-1, 512, 32, 32]           1,024
             SiLU-84          [-1, 512, 32, 32]               0
           Conv2d-85          [-1, 512, 32, 32]           4,608
      BatchNorm2d-86          [-1, 512, 32, 32]           1,024
             SiLU-87          [-1, 512, 32, 32]               0
           Conv2d-88             [-1, 32, 1, 1]          16,416
             SiLU-89             [-1, 32, 1, 1]               0
           Conv2d-90            [-1, 512, 1, 1]          16,896
          Sigmoid-91            [-1, 512, 1, 1]               0
    SqueezeExcite-92          [-1, 512, 32, 32]               0
           Conv2d-93          [-1, 128, 32, 32]          65,536
      BatchNorm2d-94          [-1, 128, 32, 32]             256
 InvertedResidual-95          [-1, 128, 32, 32]               0
           Conv2d-96          [-1, 512, 32, 32]          65,536
      BatchNorm2d-97          [-1, 512, 32, 32]           1,024
             SiLU-98          [-1, 512, 32, 32]               0
           Conv2d-99          [-1, 512, 32, 32]           4,608
     BatchNorm2d-100          [-1, 512, 32, 32]           1,024
            SiLU-101          [-1, 512, 32, 32]               0
          Conv2d-102             [-1, 32, 1, 1]          16,416
            SiLU-103             [-1, 32, 1, 1]               0
          Conv2d-104            [-1, 512, 1, 1]          16,896
         Sigmoid-105            [-1, 512, 1, 1]               0
   SqueezeExcite-106          [-1, 512, 32, 32]               0
          Conv2d-107          [-1, 128, 32, 32]          65,536
     BatchNorm2d-108          [-1, 128, 32, 32]             256
InvertedResidual-109          [-1, 128, 32, 32]               0
          Conv2d-110          [-1, 512, 32, 32]          65,536
     BatchNorm2d-111          [-1, 512, 32, 32]           1,024
            SiLU-112          [-1, 512, 32, 32]               0
          Conv2d-113          [-1, 512, 32, 32]           4,608
     BatchNorm2d-114          [-1, 512, 32, 32]           1,024
            SiLU-115          [-1, 512, 32, 32]               0
          Conv2d-116             [-1, 32, 1, 1]          16,416
            SiLU-117             [-1, 32, 1, 1]               0
          Conv2d-118            [-1, 512, 1, 1]          16,896
         Sigmoid-119            [-1, 512, 1, 1]               0
   SqueezeExcite-120          [-1, 512, 32, 32]               0
          Conv2d-121          [-1, 128, 32, 32]          65,536
     BatchNorm2d-122          [-1, 128, 32, 32]             256
InvertedResidual-123          [-1, 128, 32, 32]               0
          Conv2d-124          [-1, 512, 32, 32]          65,536
     BatchNorm2d-125          [-1, 512, 32, 32]           1,024
            SiLU-126          [-1, 512, 32, 32]               0
          Conv2d-127          [-1, 512, 32, 32]           4,608
     BatchNorm2d-128          [-1, 512, 32, 32]           1,024
            SiLU-129          [-1, 512, 32, 32]               0
          Conv2d-130             [-1, 32, 1, 1]          16,416
            SiLU-131             [-1, 32, 1, 1]               0
          Conv2d-132            [-1, 512, 1, 1]          16,896
         Sigmoid-133            [-1, 512, 1, 1]               0
   SqueezeExcite-134          [-1, 512, 32, 32]               0
          Conv2d-135          [-1, 128, 32, 32]          65,536
     BatchNorm2d-136          [-1, 128, 32, 32]             256
InvertedResidual-137          [-1, 128, 32, 32]               0
          Conv2d-138          [-1, 512, 32, 32]          65,536
     BatchNorm2d-139          [-1, 512, 32, 32]           1,024
            SiLU-140          [-1, 512, 32, 32]               0
          Conv2d-141          [-1, 512, 32, 32]           4,608
     BatchNorm2d-142          [-1, 512, 32, 32]           1,024
            SiLU-143          [-1, 512, 32, 32]               0
          Conv2d-144             [-1, 32, 1, 1]          16,416
            SiLU-145             [-1, 32, 1, 1]               0
          Conv2d-146            [-1, 512, 1, 1]          16,896
         Sigmoid-147            [-1, 512, 1, 1]               0
   SqueezeExcite-148          [-1, 512, 32, 32]               0
          Conv2d-149          [-1, 128, 32, 32]          65,536
     BatchNorm2d-150          [-1, 128, 32, 32]             256
InvertedResidual-151          [-1, 128, 32, 32]               0
          Conv2d-152          [-1, 768, 32, 32]          98,304
     BatchNorm2d-153          [-1, 768, 32, 32]           1,536
            SiLU-154          [-1, 768, 32, 32]               0
          Conv2d-155          [-1, 768, 32, 32]           6,912
     BatchNorm2d-156          [-1, 768, 32, 32]           1,536
            SiLU-157          [-1, 768, 32, 32]               0
          Conv2d-158             [-1, 32, 1, 1]          24,608
            SiLU-159             [-1, 32, 1, 1]               0
          Conv2d-160            [-1, 768, 1, 1]          25,344
         Sigmoid-161            [-1, 768, 1, 1]               0
   SqueezeExcite-162          [-1, 768, 32, 32]               0
          Conv2d-163          [-1, 160, 32, 32]         122,880
     BatchNorm2d-164          [-1, 160, 32, 32]             320
InvertedResidual-165          [-1, 160, 32, 32]               0
          Conv2d-166          [-1, 960, 32, 32]         153,600
     BatchNorm2d-167          [-1, 960, 32, 32]           1,920
            SiLU-168          [-1, 960, 32, 32]               0
          Conv2d-169          [-1, 960, 32, 32]           8,640
     BatchNorm2d-170          [-1, 960, 32, 32]           1,920
            SiLU-171          [-1, 960, 32, 32]               0
          Conv2d-172             [-1, 40, 1, 1]          38,440
            SiLU-173             [-1, 40, 1, 1]               0
          Conv2d-174            [-1, 960, 1, 1]          39,360
         Sigmoid-175            [-1, 960, 1, 1]               0
   SqueezeExcite-176          [-1, 960, 32, 32]               0
          Conv2d-177          [-1, 160, 32, 32]         153,600
     BatchNorm2d-178          [-1, 160, 32, 32]             320
InvertedResidual-179          [-1, 160, 32, 32]               0
          Conv2d-180          [-1, 960, 32, 32]         153,600
     BatchNorm2d-181          [-1, 960, 32, 32]           1,920
            SiLU-182          [-1, 960, 32, 32]               0
          Conv2d-183          [-1, 960, 32, 32]           8,640
     BatchNorm2d-184          [-1, 960, 32, 32]           1,920
            SiLU-185          [-1, 960, 32, 32]               0
          Conv2d-186             [-1, 40, 1, 1]          38,440
            SiLU-187             [-1, 40, 1, 1]               0
          Conv2d-188            [-1, 960, 1, 1]          39,360
         Sigmoid-189            [-1, 960, 1, 1]               0
   SqueezeExcite-190          [-1, 960, 32, 32]               0
          Conv2d-191          [-1, 160, 32, 32]         153,600
     BatchNorm2d-192          [-1, 160, 32, 32]             320
InvertedResidual-193          [-1, 160, 32, 32]               0
          Conv2d-194          [-1, 960, 32, 32]         153,600
     BatchNorm2d-195          [-1, 960, 32, 32]           1,920
            SiLU-196          [-1, 960, 32, 32]               0
          Conv2d-197          [-1, 960, 32, 32]           8,640
     BatchNorm2d-198          [-1, 960, 32, 32]           1,920
            SiLU-199          [-1, 960, 32, 32]               0
          Conv2d-200             [-1, 40, 1, 1]          38,440
            SiLU-201             [-1, 40, 1, 1]               0
          Conv2d-202            [-1, 960, 1, 1]          39,360
         Sigmoid-203            [-1, 960, 1, 1]               0
   SqueezeExcite-204          [-1, 960, 32, 32]               0
          Conv2d-205          [-1, 160, 32, 32]         153,600
     BatchNorm2d-206          [-1, 160, 32, 32]             320
InvertedResidual-207          [-1, 160, 32, 32]               0
          Conv2d-208          [-1, 960, 32, 32]         153,600
     BatchNorm2d-209          [-1, 960, 32, 32]           1,920
            SiLU-210          [-1, 960, 32, 32]               0
          Conv2d-211          [-1, 960, 32, 32]           8,640
     BatchNorm2d-212          [-1, 960, 32, 32]           1,920
            SiLU-213          [-1, 960, 32, 32]               0
          Conv2d-214             [-1, 40, 1, 1]          38,440
            SiLU-215             [-1, 40, 1, 1]               0
          Conv2d-216            [-1, 960, 1, 1]          39,360
         Sigmoid-217            [-1, 960, 1, 1]               0
   SqueezeExcite-218          [-1, 960, 32, 32]               0
          Conv2d-219          [-1, 160, 32, 32]         153,600
     BatchNorm2d-220          [-1, 160, 32, 32]             320
InvertedResidual-221          [-1, 160, 32, 32]               0
          Conv2d-222          [-1, 960, 32, 32]         153,600
     BatchNorm2d-223          [-1, 960, 32, 32]           1,920
            SiLU-224          [-1, 960, 32, 32]               0
          Conv2d-225          [-1, 960, 32, 32]           8,640
     BatchNorm2d-226          [-1, 960, 32, 32]           1,920
            SiLU-227          [-1, 960, 32, 32]               0
          Conv2d-228             [-1, 40, 1, 1]          38,440
            SiLU-229             [-1, 40, 1, 1]               0
          Conv2d-230            [-1, 960, 1, 1]          39,360
         Sigmoid-231            [-1, 960, 1, 1]               0
   SqueezeExcite-232          [-1, 960, 32, 32]               0
          Conv2d-233          [-1, 160, 32, 32]         153,600
     BatchNorm2d-234          [-1, 160, 32, 32]             320
InvertedResidual-235          [-1, 160, 32, 32]               0
          Conv2d-236          [-1, 960, 32, 32]         153,600
     BatchNorm2d-237          [-1, 960, 32, 32]           1,920
            SiLU-238          [-1, 960, 32, 32]               0
          Conv2d-239          [-1, 960, 32, 32]           8,640
     BatchNorm2d-240          [-1, 960, 32, 32]           1,920
            SiLU-241          [-1, 960, 32, 32]               0
          Conv2d-242             [-1, 40, 1, 1]          38,440
            SiLU-243             [-1, 40, 1, 1]               0
          Conv2d-244            [-1, 960, 1, 1]          39,360
         Sigmoid-245            [-1, 960, 1, 1]               0
   SqueezeExcite-246          [-1, 960, 32, 32]               0
          Conv2d-247          [-1, 160, 32, 32]         153,600
     BatchNorm2d-248          [-1, 160, 32, 32]             320
InvertedResidual-249          [-1, 160, 32, 32]               0
          Conv2d-250          [-1, 960, 32, 32]         153,600
     BatchNorm2d-251          [-1, 960, 32, 32]           1,920
            SiLU-252          [-1, 960, 32, 32]               0
          Conv2d-253          [-1, 960, 32, 32]           8,640
     BatchNorm2d-254          [-1, 960, 32, 32]           1,920
            SiLU-255          [-1, 960, 32, 32]               0
          Conv2d-256             [-1, 40, 1, 1]          38,440
            SiLU-257             [-1, 40, 1, 1]               0
          Conv2d-258            [-1, 960, 1, 1]          39,360
         Sigmoid-259            [-1, 960, 1, 1]               0
   SqueezeExcite-260          [-1, 960, 32, 32]               0
          Conv2d-261          [-1, 160, 32, 32]         153,600
     BatchNorm2d-262          [-1, 160, 32, 32]             320
InvertedResidual-263          [-1, 160, 32, 32]               0
          Conv2d-264          [-1, 960, 32, 32]         153,600
     BatchNorm2d-265          [-1, 960, 32, 32]           1,920
            SiLU-266          [-1, 960, 32, 32]               0
          Conv2d-267          [-1, 960, 32, 32]           8,640
     BatchNorm2d-268          [-1, 960, 32, 32]           1,920
            SiLU-269          [-1, 960, 32, 32]               0
          Conv2d-270             [-1, 40, 1, 1]          38,440
            SiLU-271             [-1, 40, 1, 1]               0
          Conv2d-272            [-1, 960, 1, 1]          39,360
         Sigmoid-273            [-1, 960, 1, 1]               0
   SqueezeExcite-274          [-1, 960, 32, 32]               0
          Conv2d-275          [-1, 160, 32, 32]         153,600
     BatchNorm2d-276          [-1, 160, 32, 32]             320
InvertedResidual-277          [-1, 160, 32, 32]               0
          Conv2d-278          [-1, 960, 32, 32]         153,600
     BatchNorm2d-279          [-1, 960, 32, 32]           1,920
            SiLU-280          [-1, 960, 32, 32]               0
          Conv2d-281          [-1, 960, 16, 16]           8,640
     BatchNorm2d-282          [-1, 960, 16, 16]           1,920
            SiLU-283          [-1, 960, 16, 16]               0
          Conv2d-284             [-1, 40, 1, 1]          38,440
            SiLU-285             [-1, 40, 1, 1]               0
          Conv2d-286            [-1, 960, 1, 1]          39,360
         Sigmoid-287            [-1, 960, 1, 1]               0
   SqueezeExcite-288          [-1, 960, 16, 16]               0
          Conv2d-289          [-1, 256, 16, 16]         245,760
     BatchNorm2d-290          [-1, 256, 16, 16]             512
InvertedResidual-291          [-1, 256, 16, 16]               0
          Conv2d-292         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-293         [-1, 1536, 16, 16]           3,072
            SiLU-294         [-1, 1536, 16, 16]               0
          Conv2d-295         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-296         [-1, 1536, 16, 16]           3,072
            SiLU-297         [-1, 1536, 16, 16]               0
          Conv2d-298             [-1, 64, 1, 1]          98,368
            SiLU-299             [-1, 64, 1, 1]               0
          Conv2d-300           [-1, 1536, 1, 1]          99,840
         Sigmoid-301           [-1, 1536, 1, 1]               0
   SqueezeExcite-302         [-1, 1536, 16, 16]               0
          Conv2d-303          [-1, 256, 16, 16]         393,216
     BatchNorm2d-304          [-1, 256, 16, 16]             512
InvertedResidual-305          [-1, 256, 16, 16]               0
          Conv2d-306         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-307         [-1, 1536, 16, 16]           3,072
            SiLU-308         [-1, 1536, 16, 16]               0
          Conv2d-309         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-310         [-1, 1536, 16, 16]           3,072
            SiLU-311         [-1, 1536, 16, 16]               0
          Conv2d-312             [-1, 64, 1, 1]          98,368
            SiLU-313             [-1, 64, 1, 1]               0
          Conv2d-314           [-1, 1536, 1, 1]          99,840
         Sigmoid-315           [-1, 1536, 1, 1]               0
   SqueezeExcite-316         [-1, 1536, 16, 16]               0
          Conv2d-317          [-1, 256, 16, 16]         393,216
     BatchNorm2d-318          [-1, 256, 16, 16]             512
InvertedResidual-319          [-1, 256, 16, 16]               0
          Conv2d-320         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-321         [-1, 1536, 16, 16]           3,072
            SiLU-322         [-1, 1536, 16, 16]               0
          Conv2d-323         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-324         [-1, 1536, 16, 16]           3,072
            SiLU-325         [-1, 1536, 16, 16]               0
          Conv2d-326             [-1, 64, 1, 1]          98,368
            SiLU-327             [-1, 64, 1, 1]               0
          Conv2d-328           [-1, 1536, 1, 1]          99,840
         Sigmoid-329           [-1, 1536, 1, 1]               0
   SqueezeExcite-330         [-1, 1536, 16, 16]               0
          Conv2d-331          [-1, 256, 16, 16]         393,216
     BatchNorm2d-332          [-1, 256, 16, 16]             512
InvertedResidual-333          [-1, 256, 16, 16]               0
          Conv2d-334         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-335         [-1, 1536, 16, 16]           3,072
            SiLU-336         [-1, 1536, 16, 16]               0
          Conv2d-337         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-338         [-1, 1536, 16, 16]           3,072
            SiLU-339         [-1, 1536, 16, 16]               0
          Conv2d-340             [-1, 64, 1, 1]          98,368
            SiLU-341             [-1, 64, 1, 1]               0
          Conv2d-342           [-1, 1536, 1, 1]          99,840
         Sigmoid-343           [-1, 1536, 1, 1]               0
   SqueezeExcite-344         [-1, 1536, 16, 16]               0
          Conv2d-345          [-1, 256, 16, 16]         393,216
     BatchNorm2d-346          [-1, 256, 16, 16]             512
InvertedResidual-347          [-1, 256, 16, 16]               0
          Conv2d-348         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-349         [-1, 1536, 16, 16]           3,072
            SiLU-350         [-1, 1536, 16, 16]               0
          Conv2d-351         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-352         [-1, 1536, 16, 16]           3,072
            SiLU-353         [-1, 1536, 16, 16]               0
          Conv2d-354             [-1, 64, 1, 1]          98,368
            SiLU-355             [-1, 64, 1, 1]               0
          Conv2d-356           [-1, 1536, 1, 1]          99,840
         Sigmoid-357           [-1, 1536, 1, 1]               0
   SqueezeExcite-358         [-1, 1536, 16, 16]               0
          Conv2d-359          [-1, 256, 16, 16]         393,216
     BatchNorm2d-360          [-1, 256, 16, 16]             512
InvertedResidual-361          [-1, 256, 16, 16]               0
          Conv2d-362         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-363         [-1, 1536, 16, 16]           3,072
            SiLU-364         [-1, 1536, 16, 16]               0
          Conv2d-365         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-366         [-1, 1536, 16, 16]           3,072
            SiLU-367         [-1, 1536, 16, 16]               0
          Conv2d-368             [-1, 64, 1, 1]          98,368
            SiLU-369             [-1, 64, 1, 1]               0
          Conv2d-370           [-1, 1536, 1, 1]          99,840
         Sigmoid-371           [-1, 1536, 1, 1]               0
   SqueezeExcite-372         [-1, 1536, 16, 16]               0
          Conv2d-373          [-1, 256, 16, 16]         393,216
     BatchNorm2d-374          [-1, 256, 16, 16]             512
InvertedResidual-375          [-1, 256, 16, 16]               0
          Conv2d-376         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-377         [-1, 1536, 16, 16]           3,072
            SiLU-378         [-1, 1536, 16, 16]               0
          Conv2d-379         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-380         [-1, 1536, 16, 16]           3,072
            SiLU-381         [-1, 1536, 16, 16]               0
          Conv2d-382             [-1, 64, 1, 1]          98,368
            SiLU-383             [-1, 64, 1, 1]               0
          Conv2d-384           [-1, 1536, 1, 1]          99,840
         Sigmoid-385           [-1, 1536, 1, 1]               0
   SqueezeExcite-386         [-1, 1536, 16, 16]               0
          Conv2d-387          [-1, 256, 16, 16]         393,216
     BatchNorm2d-388          [-1, 256, 16, 16]             512
InvertedResidual-389          [-1, 256, 16, 16]               0
          Conv2d-390         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-391         [-1, 1536, 16, 16]           3,072
            SiLU-392         [-1, 1536, 16, 16]               0
          Conv2d-393         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-394         [-1, 1536, 16, 16]           3,072
            SiLU-395         [-1, 1536, 16, 16]               0
          Conv2d-396             [-1, 64, 1, 1]          98,368
            SiLU-397             [-1, 64, 1, 1]               0
          Conv2d-398           [-1, 1536, 1, 1]          99,840
         Sigmoid-399           [-1, 1536, 1, 1]               0
   SqueezeExcite-400         [-1, 1536, 16, 16]               0
          Conv2d-401          [-1, 256, 16, 16]         393,216
     BatchNorm2d-402          [-1, 256, 16, 16]             512
InvertedResidual-403          [-1, 256, 16, 16]               0
          Conv2d-404         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-405         [-1, 1536, 16, 16]           3,072
            SiLU-406         [-1, 1536, 16, 16]               0
          Conv2d-407         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-408         [-1, 1536, 16, 16]           3,072
            SiLU-409         [-1, 1536, 16, 16]               0
          Conv2d-410             [-1, 64, 1, 1]          98,368
            SiLU-411             [-1, 64, 1, 1]               0
          Conv2d-412           [-1, 1536, 1, 1]          99,840
         Sigmoid-413           [-1, 1536, 1, 1]               0
   SqueezeExcite-414         [-1, 1536, 16, 16]               0
          Conv2d-415          [-1, 256, 16, 16]         393,216
     BatchNorm2d-416          [-1, 256, 16, 16]             512
InvertedResidual-417          [-1, 256, 16, 16]               0
          Conv2d-418         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-419         [-1, 1536, 16, 16]           3,072
            SiLU-420         [-1, 1536, 16, 16]               0
          Conv2d-421         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-422         [-1, 1536, 16, 16]           3,072
            SiLU-423         [-1, 1536, 16, 16]               0
          Conv2d-424             [-1, 64, 1, 1]          98,368
            SiLU-425             [-1, 64, 1, 1]               0
          Conv2d-426           [-1, 1536, 1, 1]          99,840
         Sigmoid-427           [-1, 1536, 1, 1]               0
   SqueezeExcite-428         [-1, 1536, 16, 16]               0
          Conv2d-429          [-1, 256, 16, 16]         393,216
     BatchNorm2d-430          [-1, 256, 16, 16]             512
InvertedResidual-431          [-1, 256, 16, 16]               0
          Conv2d-432         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-433         [-1, 1536, 16, 16]           3,072
            SiLU-434         [-1, 1536, 16, 16]               0
          Conv2d-435         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-436         [-1, 1536, 16, 16]           3,072
            SiLU-437         [-1, 1536, 16, 16]               0
          Conv2d-438             [-1, 64, 1, 1]          98,368
            SiLU-439             [-1, 64, 1, 1]               0
          Conv2d-440           [-1, 1536, 1, 1]          99,840
         Sigmoid-441           [-1, 1536, 1, 1]               0
   SqueezeExcite-442         [-1, 1536, 16, 16]               0
          Conv2d-443          [-1, 256, 16, 16]         393,216
     BatchNorm2d-444          [-1, 256, 16, 16]             512
InvertedResidual-445          [-1, 256, 16, 16]               0
          Conv2d-446         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-447         [-1, 1536, 16, 16]           3,072
            SiLU-448         [-1, 1536, 16, 16]               0
          Conv2d-449         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-450         [-1, 1536, 16, 16]           3,072
            SiLU-451         [-1, 1536, 16, 16]               0
          Conv2d-452             [-1, 64, 1, 1]          98,368
            SiLU-453             [-1, 64, 1, 1]               0
          Conv2d-454           [-1, 1536, 1, 1]          99,840
         Sigmoid-455           [-1, 1536, 1, 1]               0
   SqueezeExcite-456         [-1, 1536, 16, 16]               0
          Conv2d-457          [-1, 256, 16, 16]         393,216
     BatchNorm2d-458          [-1, 256, 16, 16]             512
InvertedResidual-459          [-1, 256, 16, 16]               0
          Conv2d-460         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-461         [-1, 1536, 16, 16]           3,072
            SiLU-462         [-1, 1536, 16, 16]               0
          Conv2d-463         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-464         [-1, 1536, 16, 16]           3,072
            SiLU-465         [-1, 1536, 16, 16]               0
          Conv2d-466             [-1, 64, 1, 1]          98,368
            SiLU-467             [-1, 64, 1, 1]               0
          Conv2d-468           [-1, 1536, 1, 1]          99,840
         Sigmoid-469           [-1, 1536, 1, 1]               0
   SqueezeExcite-470         [-1, 1536, 16, 16]               0
          Conv2d-471          [-1, 256, 16, 16]         393,216
     BatchNorm2d-472          [-1, 256, 16, 16]             512
InvertedResidual-473          [-1, 256, 16, 16]               0
          Conv2d-474         [-1, 1536, 16, 16]         393,216
     BatchNorm2d-475         [-1, 1536, 16, 16]           3,072
            SiLU-476         [-1, 1536, 16, 16]               0
          Conv2d-477         [-1, 1536, 16, 16]          13,824
     BatchNorm2d-478         [-1, 1536, 16, 16]           3,072
            SiLU-479         [-1, 1536, 16, 16]               0
          Conv2d-480             [-1, 64, 1, 1]          98,368
            SiLU-481             [-1, 64, 1, 1]               0
          Conv2d-482           [-1, 1536, 1, 1]          99,840
         Sigmoid-483           [-1, 1536, 1, 1]               0
   SqueezeExcite-484         [-1, 1536, 16, 16]               0
          Conv2d-485          [-1, 256, 16, 16]         393,216
     BatchNorm2d-486          [-1, 256, 16, 16]             512
InvertedResidual-487          [-1, 256, 16, 16]               0
          Conv2d-488         [-1, 1280, 16, 16]         327,680
     BatchNorm2d-489         [-1, 1280, 16, 16]           2,560
            SiLU-490         [-1, 1280, 16, 16]               0
AdaptiveAvgPool2d-491           [-1, 1280, 2, 2]               0
        Identity-492           [-1, 1280, 2, 2]               0
    EfficientNet-493           [-1, 1280, 2, 2]               0
         Flatten-494                 [-1, 5120]               0
          Linear-495             [-1, 1, 1, 16]              32
            Mish-496             [-1, 1, 1, 16]               0
         Flatten-497                   [-1, 16]               0
          Linear-498                 [-1, 1000]       5,137,000
            Mish-499                 [-1, 1000]               0
          Linear-500                 [-1, 1000]       1,001,000
            Mish-501                 [-1, 1000]               0
          Linear-502                    [-1, 1]           1,001
================================================================
Total params: 26,316,089
Trainable params: 26,316,089
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.95
Forward/backward pass size (MB): 1694.25
Params size (MB): 100.39
Estimated Total Size (MB): 1795.59
----------------------------------------------------------------